cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "zsh-completion"
brew "zsh-autosuggestions"
brew "git"
brew "watch"
brew "wget"
brew "jenv"
brew "openjdk@21"
brew "trash"
brew "kubectl"
brew "gradle"
brew "maven"

cask "alfred"
cask "iterm2"
cask "karabiner-elements"
cask "jetbrains-toolbox"
cask "slack"
cask "rectangle"
